tronicbaumi/Masters25/mc_foc_sl_fip_float_dsPIC33A_mclv48v300w/project/x2cmodel/Controller/Common/Target.h
#elif defined(X2C_SERIES_TMS320F280013X)
#include <sysctl.h>
#define KICK_DOG \
    do { \
        SysCtl_serviceWatchdog(); \
    } while (0)

#elif defined(X2C_SERIES_TMS320F28P55X) || defined(X2C_SERIES_MSPM0G)
/* do nothing, just avoid compiler errors */
#elif defined(__MATLAB__) || defined(__SCILAB__) || defined(__VENDOR_KEBA__)
/* do nothing, just avoid compiler errors */
#else
#error PROCESSOR TYPE NOT DEFINED
#endif

/* datatype definitions */
#if defined(__MATLAB__) || defined(__SCILAB__)
#if defined(_WIN32) || defined(_WIN64) || defined(__linux__)
#if defined(__MATLAB__)
#include <tmwtypes.h>
#elif defined(__SCILAB__)
typedef char bool;
#define false ((char)0)
#define true  (!false)
#endif	  
typedef signed char int8;
typedef unsigned char uint8;
typedef signed short int16;
typedef unsigned short uint16;
typedef signed long int32;
typedef unsigned long uint32;
typedef signed long long int64;
typedef unsigned long long uint64;
typedef float float32;
typedef double float64;
#else
#error UNSUPPORTED ARCHITECTURE
#endif
#elif defined(__TMS320F2806X__) || defined(__TMS320F2833X__) || \
	defined(__TMS320F280X__) || defined(__TMS320F281X__)
#include <stdbool.h>
/* int16, int32, int64 already defined in TI header files */
typedef signed char int8;
typedef unsigned char uint8;
typedef unsigned int uint16;
typedef unsigned long uint32;
typedef unsigned long long uint64;
#elif defined(__TMS320F2803X__) || defined(__TMS320F2802X__)
#include <stdbool.h>
/* int16, int32 already defined in TI header file */
typedef signed char int8;
typedef long long int64;
typedef unsigned char uint8;
typedef unsigned int uint16;
typedef unsigned long uint32;
typedef unsigned long long uint64;
#elif defined(X2C_SERIES_TMS32F2837X)
#include <stdbool.h>
#include <stdint.h>
typedef int_least8_t int8;
typedef uint_least8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef int64_t int64;
typedef uint64_t uint64;
typedef float float32;
typedef long double float64;
#elif defined(X2C_SERIES_TMS320F28004X)
#include <stdbool.h>
#include <stdint.h>
typedef int_least8_t int8_t;
typedef uint_least8_t uint8_t;

// ToDo: remove uintX and intX type definitions once the *_t types are fully established!
/* int16, int32, int64 already defined in TI header files */
typedef int_least8_t int8;
typedef uint_least8_t uint8;
typedef uint16_t uint16;
typedef uint32_t uint32;
typedef uint64_t uint64;

#elif defined(X2C_SERIES_TMS320F2838X)
#include <stdbool.h>
#include <stdint.h>
typedef int_least8_t int8;
typedef uint_least8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef uint64_t uint64;
typedef int64_t int64;
typedef float float32;
typedef double float64;

#elif defined(X2C_SERIES_TMS320F28P55X)
#include <stdbool.h>
#include <stdint.h>
typedef int_least8_t int8;
typedef uint_least8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef uint64_t uint64;
typedef int64_t int64;
typedef float float32;
typedef double float64;

#elif defined(X2C_SERIES_TMS320F28003X) || defined(X2C_SERIES_TMS320F280013X)
#include <stdbool.h>
#include <stdint.h>
typedef bool bool_t;

// ToDo: remove uintX and intX type definitions once the *_t types are fully established!
typedef int_least8_t int8;
typedef uint_least8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef uint64_t uint64;
typedef int64_t int64;
typedef float float32;
typedef double float64;

#elif defined(__RENESAS_RX__) || \
  defined(__SERIES_STM32F0__) || defined(__SERIES_STM32F1__) || defined(__SERIES_STM32F3__) || defined(X2C_SERIES_STM32F4) || \
  defined(X2C_SERIES_STM32G0) || defined(X2C_SERIES_STM32G4) || defined(X2C_SERIES_STM32H5) || \
  defined(__SERIES_TM4C__) || \
  defined(__SERIES_KECONTROL__) ||\
  defined(X2C_SERIES_XMC4800) || defined(X2C_SERIES_XMC4700) || defined(X2C_SERIES_XMC4400) || defined(X2C_SERIES_XMC4500)
#include <stdint.h>
#include <stdbool.h>    /* support for boolean datatype */
#include <string.h>		/* support for memcpy (amongst other things) */
typedef int8_t int8;
typedef uint8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef int64_t int64;
typedef uint64_t uint64;
typedef float float32;
typedef double float64;
#elif defined(X2C_SERIES_MSPM0G)
#include <stdbool.h>
#include <stdint.h>
typedef int8_t int8;
typedef uint8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef int64_t int64;
typedef uint64_t uint64;
typedef float float32;
typedef double float64;
#elif defined(__SERIES_DSPIC33E__) || defined(__SERIES_DSPIC33F__) || defined(X2C_SERIES_DSPIC33C) || \
  defined(__SERIES_PIC32MZ__) || defined(__SERIES_PIC32MX__)
#include <stdint.h>
#include <stdbool.h>    /* support for boolean datatype */
#include <string.h>		/* support for memcpy (amongst other things) */
typedef int8_t int8;
typedef uint8_t uint8;
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef int64_t int64;
typedef uint64_t uint64;
typedef float float32;
typedef long double float64;    /* the microchip compilers interpret double as 32bit float by default -> long double needed for 64bit float */
#elif defined(__SERIES_MPC5__)
#include <stdint.h>
#include <stdbool.h>
typedef signed char int8;
typedef unsigned char uint8;
typedef signed short int16;
typedef unsigned short uint16;
typedef signed int int32;
typedef unsigned int uint32;
typedef signed long long int64;
typedef unsigned long long uint64;
typedef float float32;
typedef double float64;
#elif defined(X2C_SERIES_TC3XX)
#include <stdbool.h>
#include "Platform_Types.h"
typedef sint8 int8;
typedef sint16 int16;
typedef sint32 int32;
typedef sint64 int64;
#else
#error PROCESSOR TYPE NOT DEFINED
#endif

#endif

/* type definition used by C conversion functions */
#ifdef USE_FLOAT64_CONV_FNC
typedef float64 float_CoT;
#else
typedef float32 float_CoT;
#endif

#include "Typecast.h"

/* limits for INT8 values */
#ifndef INT8_MAX
#define INT8_MAX ((int8)127)
#endif
#ifndef INT8_MIN
#define INT8_MIN ((int8)-128)
#endif
#ifndef UINT8_MAX
#define UINT8_MAX ((uint8)255)
#endif

